[{"id":1,"title":"The Shawshank Redemption","genre":"Drama","release_year":1994,"plot_summary":"A banker convicted of uxoricide forms a friendship over a quarter century with a hardened convict, while maintaining his innocence and trying to remain hopeful through simple compassion.","cast":"Tim Robbins, Morgan Freeman, Bob Gunton, William Sadler","trailer_url":"https://www.youtube.com/watch?v=PLl99DlL6b4"},{"id":2,"title":"The Godfather","genre":"Crime.Drama","release_year":1972,"plot_summary":"The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son.","cast":"Marlon Brando, Al Pacino, James Caan, Diane Keaton, Richard S. Castellano, Robert Duvall, Sterling Hayden, John Marley, Richard Conte, Al Lettieri, Abe Vigoda, Talia Shire, Gianni Russo, John Cazale, Rudy Bond, Al Martino, Morgana King, Lenny Montana","trailer_url":"https://www.youtube.com/watch?v=UaVTIH8mujA"},{"id":3,"title":"The Dark Knight","genre":"Crime.Drama.Thriller","release_year":2008,"plot_summary":"When a menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman, James Gordon and Harvey Dent must work together to put an end to the madness.","cast":"Christian Bale, Heath Ledger, Aaron Eckhart, Michael Caine, Maggie Gyllenhaal, Gary Oldman, Morgan Freeman, Monique Gabriela Curnen, Ron Dean, Cillian Murphy, Chin Han, Nestor Carbonell, Eric Roberts, Ritchie Coster, Anthony Michael Hall, Keith Szarabajka, Colin McFarlane, Joshua Harto","trailer_url":"https://www.youtube.com/watch?v=EXeTwQWrcwY"},{"id":4,"title":"12 Angry Men","genre":"Crime.Drama","release_year":1957,"plot_summary":"The jury in a New York City murder trial is frustrated by a single member whose skeptical caution forces them to more carefully consider the evidence before jumping to a hasty verdict.","cast":"Henry Fonda, Lee J. Cobb, Martin Balsam, John Fiedler, E.G. Marshall, Jack Klugman, Edward Binns, Jack Warden, Joseph Sweeney, Ed Begley, George Voskovec, Robert Webber, Rudy Bond","trailer_url":"https://www.youtube.com/watch?v=TEN-2uTi2c0"},{"id":5,"title":"The Lord of the Rings: The Return of the King","genre":"Adventure.Drama.Fantasy","release_year":2003,"plot_summary":"Gandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.","cast":"Elijah Wood, Viggo Mortensen, Ian McKellen, Orlando Bloom, Noel Appleby, Ali Astin, Sean Astin, David Aston, John Bach, Sean Bean, Cate Blanchett, Billy Boyd, Sadwyn Brophy, Alistair Browning, \r\nMarton Csokas, Richard Edge, Jason Fitch, Bernard Hill","trailer_url":"https://www.youtube.com/watch?v=r5X-hFf6Bwo"},{"id":6,"title":"Schindler's List","genre":"Biography.Drama.History","release_year":1993,"plot_summary":"In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.","cast":"Liam Neeson, Ralph Fiennes, Ben Kingsley, Caroline Goodall, Jonathan Sagall, Embeth Davidtz, Malgorzata Gebel, Shmuel Levy, Mark Ivanir, Béatrice Macola, Andrzej Seweryn, Friedrich von Thun, Krzysztof Luft, Harry Nehring, Norbert Weisser, Adi Nitzan, Michael Schneider, Miri Fabian","trailer_url":"https://www.youtube.com/watch?v=gG22XNhtnoY"},{"id":7,"title":"Pulp Fiction","genre":"Crime.Drama","release_year":1994,"plot_summary":"The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.","cast":"John Travolta, Uma Thurman, Samuel L. Jackson, Bruce Willis, Tim Roth, Amanda Plummer, Laura Lovelace, Phil LaMarr, Frank Whaley, Burr Steers, Ving Rhames, Paul Calderon, Bronagh Gallagher, Rosanna Arquette, Eric Stoltz, Jerome Patrick Hoban, Michael Gilden, Gary Shorelle","trailer_url":"https://www.youtube.com/watch?v=s7EdQ4FqbhY"},{"id":8,"title":"The Lord of the Rings: The Fellowship of the Ring","genre":"Adventure.Drama.Fantasy","release_year":2001,"plot_summary":"A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.","cast":"Elijah Wood, Ian McKellen, Orlando Bloom, Sean Bean, Alan Howard, Noel Appleby, Sean Astin, Sala Baker, Billy Boyd, Andy Serkis, Marton Csokas, Viggo Mortensen, Megan Edwards, Michael Elsworth, Cate Blanchett, Mark Ferguson, Ian Holm, Christopher Lee","trailer_url":"https://www.youtube.com/watch?v=V75dMMIW2B4"},{"id":9,"title":"The Good, the Bad and the Ugly","genre":"Adventure.Drama.Western","release_year":1966,"plot_summary":"A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery.","cast":"Clint Eastwood, Eli Wallach, Lee Van Cleef, Aldo Giuffrè,Luigi Pistilli, Rada Rassimov, Enzo Petito, Claudio Scarchilli, John Bartha, Livio Lorenzon, Antonio Casale, Sandro Scarchilli, Benito Stefanelli, Angelo Novi, Antonio Casas, Aldo Sambrell","trailer_url":"https://www.youtube.com/watch?v=WCN5JJY_wiA"},{"id":10,"title":"Forrest Gump","genre":"Drama.Romance","release_year":1994,"plot_summary":"The history of the United States from the 1950s to the '70s unfolds from the perspective of an Alabama man with an IQ of 75, who yearns to be reunited with his childhood sweetheart.","cast":"Tom Hanks, Robin Wright, Gary Sinise, Sally Field, Rebecca Williams, Michael Conner Humphreys, Harold G. Herthum, George Kelly, Bob Penny, John Randall, Sam Anderson, Margo Moorer, Ione M. Telech, Christine Seabrook, John Worsham, Peter Dobson, Siobhan Fallon Hogan, Alexander Zemeckis","trailer_url":"https://www.youtube.com/watch?v=bLvqoHBptjg"},{"id":11,"title":"Fight Club","genre":"Drama","release_year":1999,"plot_summary":"An insomniac office worker and a devil-may-care soap maker form an underground fight club that evolves into much more.","cast":"Brad Pitt, Edward Norton, Meat Loaf, Zach Grenier, Richmond Arquette, David Andrews, George Maguire, Eugenie Bondurant, Christina Cabot, Helena Bonham Carter, Sydney 'Big Dawg' Colston, Rachel Singer, Christie Cronenweth, Tim DeZarn, Ezra Buzzington, Dierdre Downing-Jackson, Bob Stephenson, Charlie Dell","trailer_url":"https://www.youtube.com/watch?v=qtRKdVHc-cE"},{"id":13,"title":"Inception","genre":"Action.Adventure.Sci-Fi.Thriller","release_year":2010,"plot_summary":"A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O., but his tragic past may doom the project and his team to disaster.","cast":"Leonardo DiCaprio, Joseph Gordon-Levitt, Elliot Page, Ken Watanabe, Tom Hardy, Dileep Rao, Cillian Murphy, Tom Berenger, Marion Cotillard, Pete Postlethwaite, Michael Caine, Lukas Haas, Tai-Li Lee, Claire Geare, Magnus Nolan, Taylor Geare, Johnathan Geare, Tohoru Masamune","trailer_url":"https://www.youtube.com/watch?v=YoHD9XEInc0&t=69s"},{"id":14,"title":"Star Wars: Episode V - The Empire Strikes Back","genre":"Action.Adventure.Fantasy.Sci-Fi","release_year":1980,"plot_summary":"After the Empire overpowers the Rebel Alliance, Luke Skywalker begins his Jedi training with Yoda. At the same time, Darth Vader and bounty hunter Boba Fett pursue his friends across the galaxy.","cast":"Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams, Anthony Daniels, David Prowse, Peter Mayhew, Kenny Baker, Frank Oz, Alec Guinness, Jeremy Bulloch, John Hollis, Jack Purvis, Des Webb, Clive Revill, Kenneth Colley, Julian Glover, Michael Sheard","trailer_url":"https://www.youtube.com/watch?v=JNwNXF9Y6kY"},{"id":15,"title":"The Matrix","genre":"Action.Sci-Fi","release_year":1999,"plot_summary":"When a beautiful stranger leads computer hacker Neo to a forbidding underworld, he discovers the shocking truth--the life he knows is the elaborate deception of an evil cyber-intelligence.","cast":"Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss, Hugo Weaving, Gloria Foster, Joe Pantoliano, Marcus Chong, Julian Arahanga, Matt Doran, Belinda McClory, Anthony Ray Parker, Paul Goddard, Robert Taylor, David Aston, Marc Aden Gray, Ada Nicodemou, Deni Gordon, Rowan Witt","trailer_url":"https://www.youtube.com/watch?v=vKQi3bBA1y8"},{"id":16,"title":"Goodfellas","genre":"Biography.Crime.Drama","release_year":1990,"plot_summary":"The story of Henry Hill and his life in the mafia, covering his relationship with his wife Karen and his mob partners Jimmy Conway and Tommy DeVito.","cast":"Robert De Niro, Ray Liotta, Joe Pesci, Lorraine Bracco, Paul Sorvino, Frank Sivero, Tony Darrow, Mike Starr, Frank Vincent, Chuck Low, Frank DiLeo, Henny Youngman, Gina Mastrogiacomo, Catherine Scorsese, Charles Scorsese, Suzanne Shepherd, Debi Mazar, Margo Winkler","trailer_url":"https://www.youtube.com/watch?v=2ilzidi_J8Q"},{"id":17,"title":"One Flew Over the Cuckoo's Nest","genre":"Drama","release_year":1975,"plot_summary":"In the Fall of 1963, a Korean War veteran and criminal pleads insanity and is admitted to a mental institution, where he rallies up the scared patients against the tyrannical nurse.","cast":"Jack Nicholson, Louise Fletcher, Michael Berryman, Peter Brocco, Dean R. Brooks, Alonzo Brown, Scatman Crothers, Mwako Cumbuka, Danny DeVito, William Duell, Josip Elic, Lan Fendors, Nathan George, Ken Kenny, Mel Lambert, Sydney Lassick, Kay Lee, Christopher Lloyd","trailer_url":"https://www.youtube.com/watch?v=OXrcDonY-B8"},{"id":18,"title":"Interstellar","genre":"Adventure.Drama.Sci-Fi","release_year":2014,"plot_summary":"When Earth becomes uninhabitable in the future, a farmer and ex-NASA pilot, Joseph Cooper, is tasked to pilot a spacecraft, along with a team of researchers, to find a new planet for humans.","cast":"Matthew McConaughey, Anne Hathaway, Jessica Chastain, Mackenzie Foy, Ellen Burstyn, John Lithgow, Timothée Chalamet, David Oyelowo, Collette Wolfe, Francis X. McCarthy, Bill Irwin, Andrew Borba, Wes Bentley, William Devane, Michael Caine, David Gyasi, Josh Stewart, Casey Affleck","trailer_url":"https://www.youtube.com/watch?v=2LqzF5WauAw"},{"id":19,"title":"Se7en","genre":"Crime.Drama.Mystery.Thriller","release_year":1995,"plot_summary":"Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his motives.","cast":"Morgan Freeman, Brad Pitt, Kevin Spacey, Andrew Kevin Walker, Daniel Zacapa, Gwyneth Paltrow, John Cassini, Bob Mack, Peter Crombie, Reg E. Cathey, R. Lee Ermey, George Christy, Endre Hules, Hawthorne James, William Davidson, Bob Collins, Jimmy Dale Hartsell, Richard Roundtree","trailer_url":"https://www.youtube.com/watch?v=znmZoVkCjpI"},{"id":20,"title":"It's a Wonderful Life","genre":"Drama.Family.Fantasy.Romance","release_year":1946,"plot_summary":"An angel is sent from Heaven to help a desperately frustrated businessman by showing him what life would have been like if he had never existed.","cast":"James Stewart, Donna Reed, Lionel Barrymore, Thomas Mitchell, Henry Travers, Beulah Bondi, Frank Faylen, Ward Bond, Gloria Grahame, H.B. Warner, Frank Albertson, Todd Karns, Samuel S. Hinds, Mary Treen, Virginia Patton, Charles Williams, Sarah Edwards, William Edmunds","trailer_url":"https://www.youtube.com/watch?v=iLR3gZrU2Xo"},{"id":21,"title":"Seven Samurai","genre":"Drama","release_year":1954,"plot_summary":"Farmers from a village exploited by bandits hire a veteran samurai for protection, and he gathers six other samurai to join him.","cast":"Toshirô Mifune, Takashi Shimura, Keiko Tsushima, Yukiko Shimazaki, Kamatari Fujiwara, Daisuke Katô, Isao Kimura, Minoru Chiaki, Seiji Miyaguchi, Yoshio Kosugi, Bokuzen Hidari, Yoshio Inaba, Yoshio Tsuchiya, Kokuten Kôdô, Eijirô Tôno,Kichijirô Ueda, Jun Tatara, Atsushi Watanabe","trailer_url":"https://www.youtube.com/watch?v=wJ1TOratCTo"},{"id":22,"title":"The Silence of the Lambs","genre":"Crime.Drama.Thriller","release_year":1991,"plot_summary":"A young F.B.I. cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer, a madman who skins his victims.","cast":"Jodie Foster, Anthony Hopkins, Scott Glenn, Ted Levine, Anthony Heald, Brooke Smith, Diane Baker, Kasi Lemmons, Charles Napier, Tracey Walter, Roger Corman, Ron Vawter, Danny Darst, Jeffrie Lane, Frankie Faison, Paul Lazar, Dan Butler, Chris Isaak","trailer_url":"https://www.youtube.com/watch?v=6iB21hsprAQ"},{"id":23,"title":"Saving Private Ryan","genre":"Drama.War","release_year":1998,"plot_summary":"Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action.","cast":"Tom Hanks, Matt Damon, Tom Sizemore, Edward Burns, Barry Pepper, Adam Goldberg, Vin Diesel, Giovanni Ribisi, Jeremy Davies, Ted Danson, Paul Giamatti, Dennis Farina, Joerg Stadler, Max Martini, Dylan Bruno, Daniel Cerqueira, Demetri Goritsas, Ian Porter","trailer_url":"https://www.youtube.com/watch?v=9CiW_DgxCnQ"},{"id":24,"title":"City of God","genre":"Crime.Drama","release_year":2002,"plot_summary":"In the slums of Rio, two kids' paths diverge as one struggles to become a photographer and the other a kingpin.","cast":"Alexandre Rodrigues, Leandro Firmino, Matheus Nachtergaele, Phellipe Haagensen, Douglas Silva, Jonathan Haagensen, Seu Jorge, Jefechander Suplino, Alice Braga, Emerson Gomes, Edson Oliveira, Michel Gomes, Roberta Rodrigues,Luis Otávio, Kiko Marques, Gustavo Engrácia, Darlan Cunha, Robson Rocha","trailer_url":"https://www.youtube.com/watch?v=dcUOO4Itgmw"},{"id":25,"title":"The Green Mile","genre":"Crime.Drama.Fantasy.Mystery","release_year":1999,"plot_summary":"Paul Edgecomb, the head guard of a prison, meets an inmate, John Coffey, a black man who is accused of murdering two girls. His life changes drastically when he discovers that John has a special gift.","cast":"Tom Hanks, Michael Clarke Duncan, David Morse, Bonnie Hunt, James Cromwell, Michael Jeter, Graham Greene, Doug Hutchison, Sam Rockwell, Barry Pepper, Jeffrey DeMunn, Patricia Clarkson, Harry Dean Stanton, Dabbs Greer, Eve Brent, William Sadler, Mack Miles, Rai Tasco","trailer_url":"https://www.youtube.com/watch?v=Ki4haFrqSrw"},{"id":26,"title":"Life Is Beautiful","genre":"Comedy.Drama.Romance.War","release_year":1997,"plot_summary":"When an open-minded Jewish waiter and his son become victims of the Holocaust, he uses a perfect mixture of will, humor and imagination to protect his son from the dangers around their camp.","cast":"Roberto Benigni, Nicoletta Braschi, Giorgio Cantarini, Giustino Durano, Sergio Bini Bustric, Marisa Paredes, Horst Buchholz, Lidia Alfonsi, Giuliana Lojodice, Amerigo Fontani, Pietro De Silva, Francesco Guzzo, Raffaella Lebboroni, Claudio Alfonsi, Gil Baroni, Massimo Bianchi, Jürgen Bohn,Verena Buratti","trailer_url":"https://www.youtube.com/watch?v=pAYEQP8gx3w"},{"id":27,"title":"Terminator 2: Judgment Day","genre":"Action.Adventure.Sci-Fi","release_year":1991,"plot_summary":"A cyborg, identical to the one who failed to kill Sarah Connor, must now protect her ten year old son John from an even more advanced and powerful cyborg.","cast":"Arnold Schwarzenegger, Linda Hamilton, Edward Furlong, Robert Patrick, Earl Boen, Joe Morton, S. Epatha Merkerson, Castulo Guerra, Danny Cooksey, Jenette Goldstein, Xander Berkeley, Leslie Hamilton Gearren, Ken Gibbel, Robert Winley, Pete Schrum, Shane Wilder, Michael Edwards, Jared Lounsbery","trailer_url":"https://www.youtube.com/watch?v=lwSysg9o7wE"},{"id":28,"title":"Star Wars: Episode IV - A New Hope","genre":"Action.Adventure.Fantasy.Sci-Fi","release_year":1977,"plot_summary":"Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee and two droids to save the galaxy from the Empire's world-destroying battle station, while also attempting to rescue Princess Leia from the mysterious Darth Vader.","cast":"Mark Hamill, Harrison Ford, Carrie Fisher, Alec Guinness, Peter Cushing, Anthony Daniels, Kenny Baker, Peter Mayhew, David Prowse, Phil Brown, Shelagh Fraser, Jack Purvis, Alex McCrindle, Eddie Byrne, Drewe Henley, Denis Lawson, Garrick Hagon, Jack Klaff","trailer_url":"https://www.youtube.com/watch?v=vZ734NWnAHA"},{"id":29,"title":"Back to the Future","genre":"Adventure.Comedy.Sci-Fi","release_year":1985,"plot_summary":"Marty McFly, a 17-year-old high school student, is accidentally sent 30 years into the past in a time-traveling DeLorean invented by his close friend, the maverick scientist Doc Brown.","cast":"Michael J. Fox, Christopher Lloyd, Lea Thompson, Crispin Glover, Tom Wilson, Claudia Wells, Marc McClure, Wendie Jo Sperber, George DiCenzo, Frances Lee McCain, James Tolkan, J.J. Cohen, Casey Siemaszko, Billy Zane, Harry Waters Jr., Donald Fullilove, Lisa Freeman, Cristen Kauffman","trailer_url":"https://www.youtube.com/watch?v=U71BvFM7Wpw"},{"id":30,"title":"Spirited Away","genre":"Animation.Adventure.Family.Fantasy.Mystery","release_year":2001,"plot_summary":"During her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches and spirits, and where humans are changed into beasts.","cast":"Daveigh Chase, Suzanne Pleshette, Miyu Irino, Rumi Hiiragi, Mari Natsuki, Takashi Naitô, Yasuko Sawaguchi, Tatsuya Gashûin, Ryunosuke Kamiki, Yumi Tamai, Yô Ôizumi, Koba Hayashi, Tsunehiko Kamijô, Takehiko Ono, Bunta Sugawara, Shigeru Wakita, Michiko Yamamoto","trailer_url":"https://www.youtube.com/watch?v=ByXuk9QqQkk"},{"id":31,"title":"The Pianist","genre":"Biography.Drama.Music.War","release_year":2002,"plot_summary":"During WWII, acclaimed Polish musician Wladyslaw faces various struggles as he loses contact with his family. As the situation worsens, he hides in the ruins of Warsaw in order to survive.","cast":"Adrien Brody, Thomas Kretschmann, Frank Finlay, Emilia Fox, Michal Zebrowski, Ed Stoppard, Maureen Lipman, Jessica Kate Meyer, Julia Rayner, Wanja Mues, Richard Ridings, Nomi Sharron, Anthony Milner, Lucy Skeaping, Roddy Skeaping, Ben Harlan, Thomas Lawinky, Joachim Paul Assböck","trailer_url":"https://www.youtube.com/watch?v=BFwGqLa_oAo"},{"id":32,"title":"Parasite","genre":"Drama.Thriller","release_year":2019,"plot_summary":"Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan.","cast":"Song Kang-ho, Lee Sun-kyun, Cho Yeo-jeong, Choi Woo-sik, Park So-dam, Lee Jeong-eun, Jang Hye-jin, Park Myeong-hoon, Jung Ji-so, Jung Hyun-jun, Park Keun-rok, Jung Yi-seo, Jo Jae-myeong, Jung Ik-han, Kim Kyu-baek, Hwang In-kyung, Ahn Seong-bong, Kim Jin-hyung","trailer_url":"https://www.youtube.com/watch?v=5xH0HfJHsaY"}]
